# Authors:
#   Rick Kotlarz ~ https://github.com/RickKotlarz

Descriptor:
  Name: Custom email investigation
  DisplayName: Custom email investigation
  Description: This plugin provides KQL queries to perform e-mail and mailbox investigations. https://github.com/Azure/Copilot-For-Security
  Icon: https://raw.githubusercontent.com/RickKotlarz/icons/refs/heads/main/Microsoft%20Entra%20architecture%20icons%20-%20Oct%202023/Microsoft%20Entra%20architecture%20icons%20-%20Oct%202023/Microsoft%20Blue%2048x48%20Grey%20%26%20Blue%20Icon/Mail%20Error.svg

  Settings:
    - Name: TenantId
      Description: Your Azure Tenant ID where the Sentinel workspace is in.
      HintText: Enter your Azure Tenant ID
      SettingType: string
      Required: true
    - Name: SubscriptionId
      Description: Your Azure Subscription ID where the Sentinel workspace is provisioned.
      SettingType: string
      Required: true
      HintText: Enter your Azure Subscription ID.
    - Name: WorkspaceName
      Description: The name Sentinel workspace that you'd like to reference.
      SettingType: string
      Required: true
      HintText: Enter the Sentinel workspace that you'd like to reference.
    - Name: ResourceGroupName
      Description: The Resource Group where the Sentinel workspace is provisioned..
      SettingType: string
      HintText: Enter your Resource Group where the Sentinel workspace is provisioned.
      Required: true

  SupportedAuthTypes:
    - None
   
SkillGroups:
  - Format: KQL
    Skills:
    
#####################################################################################
# Rick Kotlarz - Gets mailbox rule changes

      - Name: GetUserMailboxRules
        DisplayName: Get user mailbox rules using the OfficeActivity table
        Description: |
          Gets a users mailbox rules within a certain time frame using the OfficeActivity KQL table
        ExamplePrompts:
          - Get mailbox rules for user over the last 7 days using the OfficeActivity KQL table
          - Get mailbox rules for user using the OfficeActivity KQL table
        Inputs:
          - Name: TimeFrameToSearch
            PlaceholderValue: The time range for the query (e.g., 1d, 7d)
            Description: Time range to perform a KQL query in the format of day number followed by `d`.
            DefaultValue: 7d
            Required: false
          - Name: UserMailBox
            PlaceholderValue: Users e-mail mailbox address
            Description: Users e-mail mailbox address
            DefaultValue: 
            Required: true
        Settings:
          Target: Sentinel
          TenantId: '{{TenantId}}'
          SubscriptionId: '{{SubscriptionId}}'
          ResourceGroupName: '{{ResourceGroupName}}'
          WorkspaceName: '{{WorkspaceName}}'
          Template: |-
            // This KQL query retrieves and analyzes activity logs from the 'OfficeActivity' table for a specific user 'UserMailBox' over a defined timeframe, focusing on operations related to mailbox permissions, rules, and configurations, and summarizes parsed parameter details for further examination.
            //Run query - Find Suspicious Rules Created
            let TimePeriod = {{TimeFrameToSearch}};
            let CompromisedUser ="{{UserMailBox}}";
            OfficeActivity
            | where TimeGenerated >= ago(TimePeriod)
            | extend EST = datetime_utc_to_local(TimeGenerated, "US/Eastern")
            | where tolower(UserId) in (CompromisedUser)
            | where Operation in ("Add-MailboxPermission", "New-ManagementRoleAssignment", "Add-MailboxFolderPermission", "New-InboxRule", "Set-InboxRule", "Set-Mailbox", "New-TransportRule", "Set-TransportRule")
            | extend Name_ = tostring(parse_json(Parameters)[3].Name)
            | extend Value_ = tostring(parse_json(Parameters)[3].Value)
            | extend Value2_ = tostring(parse_json(Parameters)[4].Value)
            | extend Value4_ = tostring(parse_json(Parameters)[4].Value)

#####################################################################################
      - Name: GetAllMailboxRules
        DisplayName: Get all mailbox rules using the OfficeActivity table
        Description: |
          Gets Entra mailbox rules for a user within a certain time frame using the OfficeActivity KQL table
        ExamplePrompts:
          - Get all mailbox rules using the OfficeActivity table
          - Get all mailbox rules
          - Show me all mailbox rules
        Settings:
          Target: Sentinel
          TenantId: '{{TenantId}}'
          SubscriptionId: '{{SubscriptionId}}'
          ResourceGroupName: '{{ResourceGroupName}}'
          WorkspaceName: '{{WorkspaceName}}'
          Template: |-
            // This KQL query retrieves and analyzes activity logs from the 'OfficeActivity' table to focus on mailbox-related actions and configurations, parses relevant parameters, and summarizes the data by user and associated details for further analysis.
            OfficeActivity
            |where TimeGenerated >=ago(90d)
            |extend EST =datetime_utc_to_local(TimeGenerated,"US/Eastern")
            | where Operation == "New-InboxRule" or Operation =="Set-InboxRule"
            | extend Name_ = tostring(parse_json(Parameters)[3].Name)
            | extend Value_ = tostring(parse_json(Parameters)[3].Value)
            | extend Value2_ = tostring(parse_json(Parameters)[4].Value)
            | extend Value4_ = tostring(parse_json(Parameters)[4].Value)